# FabricationConfigurationCorrupted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FabricationConfigurationCorrupted Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FabricationConfigurationCorrupted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationConfigurationCorrupted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FabricationConfigurationCorrupted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace